[
  {
    "id": 1,
    "title": "EA FC 25 Ultimate Team",
    "company": "Electronic Arts",
    "description": "Enhanced player engagement strategies for one of gaming's largest live services.",
    "impact": "Contributed to improved player retention through data analysis and content optimization",
    "image": "/images/ea-fc.jpg",
    "tags": ["Data Analytics", "Live Service", "Player Experience", "Content Strategy"],
    "link": "#",
    "featured": true,
    "domain": "Gaming & Analytics",
    "details": {
      "challenge": "EA FC Ultimate Team needed to maintain player engagement and optimize content releases to keep the community active throughout the season.",
      "role": "As a member of the analytics team, I contributed to player behavior analysis and helped identify engagement patterns to inform content strategy decisions.",
      "approach": "Analyzed player data to understand engagement patterns and behavior trends. Collaborated with the team to suggest content timing optimizations based on data insights.",
      "technologies": ["Excel", "SQL", "Jira", "Confluence"],
      "outcomes": [
        "Contributed to team efforts in analyzing player engagement metrics",
        "Helped identify key periods for content releases",
        "Participated in cross-functional meetings to share insights",
        "Gained valuable experience in live service analytics"
      ],
      "learnings": "This experience taught me the importance of data-driven decision making in live service games and how player behavior analysis can inform content strategies.",
      "timeline": "September 2024 - Present",
      "teamSize": "Part of larger analytics team",
      "images": ["/images/ea-fc-dashboard.jpg", "/images/ea-fc-analytics.jpg"],
      "metrics": {
        "dataAnalyzed": "1000+ hours",
        "reportsCreated": "15+",
        "insightsDelivered": "Weekly",
        "teamCollaboration": "Cross-functional"
      }
    }
  },
  {
    "id": 2,
    "title": "Vote It! Democracy Game",
    "company": "ARDEN - Play for Democracy",
    "description": "Produced and co-designed a mobile game promoting democratic engagement for young audiences.",
    "impact": "Successfully delivered project on time while maintaining quality standards",
    "image": "/images/vote-it.jpg",
    "tags": ["Production", "Game Design", "Mobile Development", "Social Impact"],
    "link": "#",
    "featured": true,
    "domain": "Leadership & Social Impact",
    "details": {
      "challenge": "ARDEN needed to create an engaging mobile game that would educate young people about democracy and encourage civic participation, working within budget constraints and timeline requirements.",
      "role": "Producer and Game Designer, responsible for project coordination, design decisions, team communication, and ensuring the project met its educational and engagement goals.",
      "approach": "Implemented structured production processes with regular milestones and team check-ins. Co-designed game mechanics that balanced educational content with engaging gameplay. Coordinated between development, art, and content teams.",
      "technologies": ["Unity", "C#", "Jira", "Slack", "Miro", "Figma"],
      "outcomes": [
        "Successfully launched on iOS and Android on schedule",
        "Reached 2,000 downloads in initial release period",
        "Received positive feedback from test groups",
        "Created an educational tool that effectively teaches democratic concepts",
        "Built strong relationships with team members and stakeholders"
      ],
      "learnings": "This project taught me how to balance creative vision with practical constraints, and showed me the potential of games as educational tools for social impact.",
      "timeline": "March 2024 - August 2024",
      "teamSize": "7 person development team",
      "images": ["/images/vote-it-gameplay.jpg", "/images/vote-it-team.jpg"],
      "metrics": {
        "onTimeDelivery": "100%",
        "teamSize": "7 members",
        "platformsLaunched": "2",
        "downloads": "2K+"
      }
    }
  },
  {
    "id": 3,
    "title": "AI Marketing Automation Experiments",
    "company": "Personal Project",
    "description": "Explored AI tools and automation workflows for marketing task optimization.",
    "impact": "Reduced time spent on repetitive tasks through smart automation",
    "image": "/images/ai-automation.jpg",
    "tags": ["AI Tools", "n8n", "ChatGPT", "Workflow Design"],
    "link": "#",
    "domain": "AI & Innovation",
    "details": {
      "challenge": "Repetitive marketing tasks were consuming significant time that could be better spent on creative and strategic work.",
      "role": "Solo experimenter and workflow designer, exploring various AI tools and creating automation workflows for personal use.",
      "approach": "Experimented with n8n to create automated workflows, integrated ChatGPT and Gemini APIs for content generation, and tested various automation scenarios to find optimal solutions.",
      "technologies": ["n8n", "ChatGPT API", "Google Gemini API", "Zapier", "Make"],
      "outcomes": [
        "Created several working automation workflows for personal use",
        "Reduced time on repetitive tasks by approximately 50%",
        "Gained hands-on experience with AI APIs and automation tools",
        "Developed reusable templates for common marketing tasks",
        "Shared learnings with peers interested in automation"
      ],
      "learnings": "This project taught me the practical applications of AI in everyday tasks and the importance of thoughtful workflow design. Not every task should be automated, but finding the right balance can significantly improve productivity.",
      "timeline": "January 2024 - April 2024",
      "teamSize": "Solo project",
      "images": ["/images/ai-workflow.jpg", "/images/ai-dashboard.jpg"],
      "metrics": {
        "timeReduction": "~50%",
        "workflowsCreated": "10+",
        "toolsExplored": "5+",
        "personalUse": "Ongoing"
      }
    }
  },
  {
    "id": 4,
    "title": "Indie Game Development",
    "company": "Personal Projects",
    "description": "Developed games using Unity and Unreal Engine as learning projects.",
    "impact": "Gained comprehensive understanding of game development pipeline",
    "image": "/images/game-dev.jpg",
    "tags": ["Unity", "Unreal Engine", "C#", "Game Design"],
    "link": "#",
    "domain": "Technical Development",
    "details": {
      "challenge": "Learning game development requires hands-on experience with multiple aspects of the development pipeline, from programming to design to deployment.",
      "role": "Solo developer handling all aspects of game creation including programming, design, art integration, and testing.",
      "approach": "Started with small prototype projects to learn the tools, gradually increasing complexity. Participated in game jams to practice rapid development. Focused on completing projects rather than perfecting them.",
      "technologies": ["Unity", "Unreal Engine 5", "C#", "C++", "Blender", "Git"],
      "outcomes": [
        "Completed several small game projects from start to finish",
        "Learned both Unity and Unreal Engine workflows",
        "Gained experience in all aspects of game development",
        "Built a portfolio of playable prototypes",
        "Connected with other indie developers in the community"
      ],
      "learnings": "Game development taught me the importance of scope management and iterative design. Starting small and actually finishing projects is more valuable than attempting overly ambitious ones.",
      "timeline": "September 2022 - December 2023",
      "teamSize": "Solo developer",
      "images": ["/images/game-prototypes.jpg", "/images/dev-workspace.jpg"],
      "metrics": {
        "projectsCompleted": "5+",
        "enginesLearned": "2",
        "skillsGained": "Full stack",
        "communityEngagement": "Active"
      }
    }
  },
  {
    "id": 5,
    "title": "Video Content Creation",
    "company": "Freelance",
    "description": "Produced video content for various clients using Adobe Creative Suite.",
    "impact": "Delivered quality video content that met client objectives",
    "image": "/images/content-production.jpg",
    "tags": ["Adobe Premiere", "After Effects", "Video Editing", "Content Creation"],
    "link": "#",
    "domain": "Creative Production",
    "details": {
      "challenge": "Different clients had varying needs for video content, from promotional materials to educational videos, each requiring a unique approach.",
      "role": "Video Editor and Content Creator, responsible for editing, post-production, and delivering final video products to client specifications.",
      "approach": "Developed a streamlined workflow for common video types. Created templates for frequently requested formats. Maintained clear communication with clients throughout the production process.",
      "technologies": ["Adobe Premiere Pro", "After Effects", "Photoshop", "Audition"],
      "outcomes": [
        "Completed projects for multiple satisfied clients",
        "Developed efficient editing workflows",
        "Built a portfolio of diverse video content",
        "Established repeat client relationships",
        "Improved technical skills through varied projects"
      ],
      "learnings": "Content creation taught me that understanding client needs and maintaining clear communication is as important as technical skills. Each project is an opportunity to refine both creative and professional abilities.",
      "timeline": "January 2023 - Present",
      "teamSize": "Solo freelancer",
      "images": ["/images/editing-suite.jpg", "/images/client-work.jpg"],
      "metrics": {
        "projectsDelivered": "20+",
        "clientSatisfaction": "High",
        "skillsRefined": "Continuous",
        "turnaroundTime": "On schedule"
      }
    }
  },
  {
    "id": 6,
    "title": "QA Testing Experience",
    "company": "Ubisoft",
    "description": "Contributed to quality assurance efforts for game releases.",
    "impact": "Helped identify and document bugs to improve game quality",
    "image": "/images/qa-testing.jpg",
    "tags": ["Game Testing", "Quality Assurance", "Bug Reporting", "Team Collaboration"],
    "link": "#",
    "domain": "Quality & Process",
    "details": {
      "challenge": "Game testing requires attention to detail and systematic approaches to identify issues that could impact player experience.",
      "role": "QA Tester, responsible for testing assigned game areas, documenting bugs, and verifying fixes.",
      "approach": "Followed established testing protocols and checklists. Documented bugs with clear reproduction steps. Collaborated with team members to ensure comprehensive coverage.",
      "technologies": ["JIRA", "Bug tracking tools", "Test documentation"],
      "outcomes": [
        "Contributed to successful game releases",
        "Identified and documented numerous bugs",
        "Learned professional QA methodologies",
        "Gained insight into game development process",
        "Developed attention to detail and patience"
      ],
      "learnings": "QA testing taught me the importance of systematic thinking and clear communication. Every bug found and fixed contributes to a better player experience.",
      "timeline": "June 2022 - March 2023",
      "teamSize": "Part of QA team",
      "images": ["/images/qa-workspace.jpg", "/images/testing-setup.jpg"],
      "metrics": {
        "bugsReported": "100+",
        "areasTested": "Multiple",
        "teamContribution": "Consistent",
        "skillsDeveloped": "Professional QA"
      }
    }
  }
]